#+title: Experiment 8 - Maximum Network Flow
#+author: Saravana Senthilkumar - 3122247001057

** 4. Complete the program so that it repeatedly finds augmenting paths and augments the flow until no more augmenting path exists.

#+begin_src python :results output :session Exp8
def function_4_compute_max_flow():
    # 4 Initialize the network
    capacity, flow, num_vertices, source, sink = function_1_represent_network()
    
    max_flow = 0
    iteration = 1
    
    # 4(a) Repeatedly search for paths in the residual graph
    while True:
        print(f"\n--- Iteration {iteration} ---")
        
        found, parent = function_2_find_augmenting_path(capacity, flow, source, sink, num_vertices)
        
        # 4(c) Stop when no path found
        if not found:
            print("\nNo more augmenting paths found. Terminating.")
            break
            
        # 4(b) Update flow
        flow_added = function_3_augment_flow(capacity, flow, parent, source, sink)
        max_flow += flow_added
        
        print(f"\n4(d) Flow added in Iteration {iteration}: {flow_added}")
        iteration += 1
        
    # 4(d) Print final results
    print("\n4(d) Final Flow along each edge:")
    for u in range(num_vertices):
        for v in range(num_vertices):
            if capacity[u][v] > 0:
                if flow[u][v] > 0:
                    print(f"{u} -> {v}: {flow[u][v]}/{capacity[u][v]}")


cap, fl, n_v, src, snk = function_1_represent_network()
found_path, parent_arr = function_2_find_augmenting_path(cap, fl, src, snk, n_v)
if found_path: function_3_augment_flow(cap, fl, parent_arr, src, snk)
function_4_compute_max_flow()
#+end_src

#+RESULTS:
#+begin_example
1(d) Input Network:
0 -> 1: 16
0 -> 2: 13
1 -> 2: 10
1 -> 3: 12
2 -> 1: 4
2 -> 4: 14
3 -> 5: 20
4 -> 5: 4

2(a) Current Residual Graph Capacities:
  Forward  0 -> 1: 16
  Forward  0 -> 2: 13
  Forward  1 -> 2: 10
  Forward  1 -> 3: 12
  Forward  2 -> 1: 4
  Forward  2 -> 4: 14
  Forward  3 -> 5: 20
  Forward  4 -> 5: 4

2(c) Augmenting Path found: 0 -> 1 -> 3 -> 5
2(d) Residual capacities along this path:
  3 -> 5: 20
  1 -> 3: 12
  0 -> 1: 16
#+end_example
